{
  "firstname": "Robert",
  "lastname": "Pelger",
  "dateofbirth": "12.07.1982",
  "title": "",
  "jobtitle": "Lean Java Expert",
  "company": "comSysto GmbH",
  "contact": {
    "landline": "+49 89 550 60 588",
    "mobile": "+49 176 144 77 580",
    "email": "robert.pelger@comsysto.com",
    "website": "http://comsysto.com",
    "address": {
      "street": "Tumblingerstr. 23",
      "postalcode": "80337",
      "city": "München",
      "country": "Deutschland",
      "state": "Bayern"
    }
  },
  "qualification": "Diplom-Informatiker (Dipl.-Inf)",
  "qualificationalinstitution": "Technische Universität Dresden (2003-2009)",
  "languages": [
    {
      "name": "Deutsch",
      "isocode": "de",
      "percentage": 100
    },
    {
      "name": "Englisch",
      "isocode": "en",
      "percentage": 90
    },
    {
      "name": "Französisch",
      "isocode": "fr",
      "percentage": 20
    }
  ],
  "certifications": [
    {
      "certificationshortname": "Certified Spring Professional",
      "certificationtooltip": "Pivotal Certified Spring Professional",
      "certificationtooltipurl": "http://www.pivotal.io/training",
      "showcase": true
    },
    {
      "certificationshortname": "Certified Scrum Master",
      "certificationtooltip": "by Boris Gloger",
      "certificationtooltipurl": "borisgloger.com",
      "showcase": true
    },
    {
      "certificationshortname": "iSAQB Certified Professional for Software Architecture Foundation Level",
      "certificationtooltip": "CPSA-F",
      "certificationtooltipurl": "http://www.isaqb.org",
      "showcase": true
    }
  ],
  "topskills": [
    {
      "name": "Java",
      "percentage": 95
    },
    {
      "name": "Spring",
      "percentage": 95
    },
    {
      "name": "Hibernate",
      "percentage": 80
    },
    {
      "name": "Apache Wicket",
      "percentage": 75
    },
    {
      "name": "Gradle",
      "percentage": 80
    },
    {
      "name": "Maven",
      "percentage": 75
    },
    {
      "name": "JavaScript",
      "percentage": 80
    },
    {
      "name": "Scrum",
      "percentage": 95
    },
    {
      "name": "HTML5/CSS",
      "percentage": 75
    }
  ],
  "aboutme": [
    "Studium der Informatik mit Schwerpunkt 'Architektur verteilter Systeme'",
    "Agile over Waterfall, Spring over JEE, Continuous Delivery over Deployment Fears"
  ],
  "experience": [
    "7 Jahre Informatik / Software Entwicklung",
    "4 Jahre Scrum/Agile Entwicklung"
  ],
  "methodicalskills": [
    "Kanban, Scrum & agile Software Development",
    "Test-driven Development",
    "Continuous Integration / Delivery",
    "Clean Code Development",
    "Scrum-Master Expertise"
  ],
  "industryskills": [
    "Online Business, Telekommunikation"
  ],
  "itskills": [
    "Java, JavaScript",
    "Spring, Wicket, Hazelcast, Hibernate, Flyway",
    "Gradle, Maven, Git, SVN, Jenkins, TeamCity",
    "Oracle, MongoDB, Neo4j",
    "JUnit, Mockito, SonarQube",
    "HTML, CSS, AngularJS, Node.js, Express, Famo.us",
    "Tomcat, Jetty, Nginx",
    "Docker, VirtualBox, Vagrant",
    "IntelliJ IDEA, Eclipse",
    "MacOS, Linux, Windows"
  ],
  "projecthistory": [
    {
      "fromDate": "2014-06-01",
      "toDate": "2014-12-31",
      "companyName": "Kassenärztliche Vereinigung Bayern",
      "companyWebsite": "http://www.kvb.de",
      "companyCity": "München",
      "position": "Softerware Developer",
      "project": "KV-Ident Plus - Webanwendungsentwicklung",
      "softwareUsed": [
        "Java",
        "Spring",
        "Spring Framework",
        "Wicket",
        "Hibernate/JPA",
        "HTML/CSS (Bootstrap)",
        "REST/SOAP Webservices",
        "Flyway",
        "Gradle",
        "Git",
        "Jenkins",
        "SonarQube"
      ],
      "descriptionTextBlocks": [
        "In Zusammenarbeit mit dem Kunden wird derzeit eine Webanwendung auf Basis von Apache Wicket und Spring Framework entwickelt und in die bestehende Anwendungslandschaft integriert. Die Anwendung bildet einen Bestellprozess ab und greift dazu auf Stammdaten der Endanwender über verschiedene interne und externe Schnittstellen zu (REST und zum Teil SOAP basierte Webservices). Die dabei gesammelten Bestelldaten werden wiederum über REST Services den Nachbarsystemen zur Auswertung und Administration zur Verfügung gestellt. Die Oberfläche der Wicket Webanwendung wird dabei mit Hilfe von Bootstrap gestaltet und customized. Weiterer Bestandteil der Projekts ist die Integration und Optimierung des Continuous Integration, bzw. Delivery Prozesses des Kunden, besondere Herausforderung ist dabei die reibungslose Durchführung von Integrationstests gegen die Vielzahl der externen Systeme und Schnittstellen.",
        "Das Team besteht aus 6 Entwicklern und einem Product Owner. Entwickelt wird dabei in einem agilen Kanban Prozess. Innerhalb des Teams bin ich sowohl für Konzeption, Entwicklung- und Test des Systems mitverantwortlich, als auch für die Gestaltung und Umsetzung des Frontends. Als Berater für schlanke Softwareentwicklung bin ich zudem technischer Ansprechpartner und Innovationstreiber beim Kunden."
      ]
    },
    {
      "fromDate": "2012-09-01",
      "toDate": "2014-05-31",
      "companyName": "Kassenärztliche Vereinignung Bayern",
      "companyWebsite": "http://www.kvb.de",
      "companyCity": "München",
      "position": "Software Developer",
      "project": "Argus - Authentisierungs- und Autorisierungslösungen für Webanwendungen und -Services",
      "softwareUsed": [
        "Java",
        "Spring",
        "Hibernate/JPA",
        "SAML 2",
        "Maven/Gradle",
        "SVN/Git",
        "Jenkins",
        "Tomcat",
        "OracleDB"
      ],
      "descriptionTextBlocks": [
        "Für die Webanwendungen und WebServices des Kunden muss eine einheitliche Single Sign-On Lösung zur (mehrstufigen) Authentisierung der Benutzer bereitgestellt werden, die es ermöglicht Benutzer aus unterschiedlichen Datenquellen über eine einheitliches System zu authentisieren. Zudem werden den einbindenden Systemen Autorisierungsdaten geliefert, um das gewünschte Berechtigungssystem in der jeweiligen Anwendung abzubilden. Diese Authentisierungslösung wird als Komponente bereitgestellt und kann so von beliebigen Kundenanwendungen eingebunden und genutzt werden.",
        "Zur Pflege der Benutzer und deren Berechtigungen wird für den Kunden eine Webanwendungen entwickelt, die eine dedizierte Rollen- und Rechtevergabe ermöglicht. Als Erweiterung zur bestehenden Authentisierungslösung wird für den Kunden zudem ein Föderiertes Identitätsmanagement auf SAML 2.0 Basis entwicklelt und eingebunden.",
        "Webanwendung, sowie die Authentisierungs- und Autorisierungslogik und die dafür bereitgestellten WebServices werden nahezu vollständig mit JEE/Spring Technologie umgesetzt.Als Softwareentwickler in einem agilen Scrum/Kanban Team von 4-5 Personen, bin ich für den gesamten Lebenszyklus des Produkts mitverantwortlich und wirke aktiv an Analyse, Design und Softwarearchitektur, sowie Umsetzung, Test und Wartung mit. Als JEE Spring Enterprise Specialist stehe ich als Ansprechpartner für Spring Technologien zur Verfügung und bringe aktive Vorschläge und Umsetzungempfehlungen in das Team ein. Ich unterstütze zudem die Umsetzung des Continuous Integration und –Delivery Prozesses mit Jenkins, Git, SVN, Gradle und Maven."
      ]
    },
    {
      "fromDate": "2012-01-01",
      "toDate": "2012-08-31",
      "companyName": "Ticket Online Software GmbH",
      "companyWebsite": "",
      "companyCity": "München",
      "position": "Teamlead / Software Developer",
      "project": "Archivierung TO30 Ticketingsystem",
      "softwareUsed": [
        "Java",
        "Oracle",
        "PL/SQL"
      ],
      "descriptionTextBlocks": [
        "Im Rahmen der Abschaltung des TO30-Ticketingsystems, müssen den Kunden des TO30-Ticketingsystems alle relevanten Buchungsdaten der vergangenen 10 Jahre bereitgestellt werden, so dass die Kunden der gesetzlichen Archivierungspflicht nachkommen können. Die Entwicklung beschränkte sich dabei hauptsächlich auf die Erstellung von Datenbank-Functions, und -Strukturen in PL/SQL zum Aggregieren und Bereitstellen der benötigten Daten, sowie die Ablaufsteuerung per Java-Client (Swing-GUI) und die Ausgabe in ein einheitliches Zielformat (CSV).",
        "Hauptschwierigkeit war dabei die Vereinheitlichung der teils sehr heterogenen Daten unterschiedlicher Kunden in ein einheitliches Format und Berücksichtigung von Laufzeit- und Systemanforderungen, sowie gesetzlicher Auflagen.",
        "Neben den Aufgaben in der Entwicklungsarbeit (Klärung von Anforderungen, Implementierung, Test), war eine weitere zentrale Aufgabe die Projektkoordination mit dem Auftraggeber (CTS Eventim), sowie externen Beratern bezüglich gesetzlicher Auflagen die beim Export, bzw. Aufbewahrung und Bereitstellung der Daten zu berücksichtigen sind.Als Teamleiter war ich innerhalb des Projekts mitverantwortlich für die Projektkoordierung und -Abstimmung, sowie als Softwareentwickler aktiv an der Entwicklungsarbeit auf Java und Datenbankseite, im Rahmen eines agilen Teams von 1-3 Entwicklern beteiligt."
      ]
    },
    {
      "fromDate": "2010-09-01",
      "toDate": "2011-12-31",
      "companyName": "Ticket Online Software GmbH",
      "companyWebsite": "",
      "companyCity": "München",
      "position": "Lead Developer",
      "project": "B2B-Integration der Ticketingsystem von CTS Eventim und TicketOnline (TO30)",
      "softwareUsed": [
        "Java",
        "Spring",
        "WebServices (SOAP/XML)",
        "JAXB2",
        "JPA2"
      ],
      "descriptionTextBlocks": [
        "Durch die Übernahme der TicketOnline Software GmbH durch die CTS Eventim AG, sollten Inhalte des TicketOnline Systems über das System von CTS verfügbar gemacht werden. Zu diesem Zweck wurde ein von CTS bereitgestellte WebService- Schnittstellenbeschreibung (WSDL) serverseitig bei TicketOnline implementiert, die als Adapter zwischen beiden Seiten diente und die Verkaufs- und Buchungsprozesse, sowie die unterschiedlichen Datenmodelle aufeinander abbildet. Die Umsetzung erfolgt dabei mit Hilfe von Spring und Spring-WS, sowie Jaxb2. Insbesondere durch den Einsatz von Spring-WS konnten Probleme mit der nicht standardkonformen WSDL vermieden werden und die einzelnen Services schnell und unkompliziert umgesetzt werden. Ebenso das Marshalling und Unmarshalling der XML-Nachrichten per Jaxb2. Für die Abbildung der Prozesse musste stellenweise die bestehende TO30-API angepasst oder neu implementiert werden. Bei ausschließlich lesendem Zugriff auf das TO30-System konnten benötigte Daten über den Einsatz von JPA 2.0 einfach ausgelesen und bereitgestellt werden.",
        "Hauptschwierigkeit lag in der Abbildung der teils sehr unterschiedlichen Prozesse und des Datenmodells zwischen den Systemen. Hier wurde in enger Abstimmung mit den Entwicklern von CTS die Modelle schrittweise angepasst und optimiert, sodass letztliche ein fehlerfreie und sichere Kommunikation und Konsistenz der System gewährleistet werden konnte.Als Softwareentwickler und im Laufe des Projekts als Teamleiter war ich am gesamten Lebenzyklus des Projekts beteiligt, insbesondere die Analyse der Prozesse des CTS-Systems, sowie an grundlegenden Architekturentscheidungen, und der Technologieauswahl war ich maßgeblich verantwortlich. Zudem stand ich während des Projekts Kollegen als Ansprechpartner für Fragen bzgl. Spring, Spring-WS, sowie WebService-Technologien zur Verfügung. Die Umsetzung des Projekts erfolgte dabei innerhalb eines Scrum-Teams von 5-7 Personen."
      ]
    },
    {
      "fromDate": "2009-10-01",
      "toDate": "2010-08-31",
      "companyName": "Ticket Online Software GmbH",
      "companyWebsite": "",
      "companyCity": "München",
      "position": "Devloper",
      "project": "Entwicklung und Erweiterung der TO30 Online Verkaufsschnittstelle",
      "softwareUsed": [
        "Java",
        "WebServices (SOAP/XML)",
        "RESTful HTTP"
      ],
      "descriptionTextBlocks": [
        "Das TO30 Ticketingsystem stellt 2 externe Schnittstellen zur Verfügung. Zum einen auf WebService-Basis für einen Verkaufs-Client der insbesondere in Vorverkaufsstellen zum Einsatz kommt. Zum anderen eine proprietäre REST-Schnittstelle für das eigene Web-Portal, sowie für Kunden die TicketOnline-Webshops in ihre eigenen Webseiten einbinden wollen. Meine Aufgabe bestand hierbei in der Pflege, Wartung und Weiterentwicklung dieser Schnittstellen, sowie die Integration mit dem TO30-Backend und die Abstimmung und Kommunikation mit den externen Client-Implementierungsteams, sowie den Kunden. Ziel war dabei die Schnittstellen zu vereinheitlichen und vereinfachen um den gesamten TO30-Buchungsprozess darüber abbilden zu können. Hauptschwierigkeit war dabei das proprietäre TO30 System, das teils umfangreiche Refactoring-Maßnahmen mit sich brachte."
      ]
    },
    {
      "fromDate": "2008-07-01",
      "toDate": "2009-07-31",
      "companyName": "T-Systems Multimedia Solutions",
      "companyWebsite": "http://www.t-systems-mms.com/",
      "companyCity": "Dresden",
      "position": "Devloper",
      "project": "Service-oriented Enterprise Applications",
      "softwareUsed": [
        "Java",
        "Spring",
        "Apache Camel",
        "Mule",
        "Spring Integration",
        "Apache ActiveMQ"
      ],
      "descriptionTextBlocks": [
        "Mitarbeit an der Umsetzung eines Suchportals. Die Basis bildete dabei ein Spring-basiertes Backend das Suchanfragen entegegen nahm und entsprechende Antworten ausgeben sollte.",
        "Die Query-Verarbeitung erfolgte dabei mehrstufig, sowohl sequentiell als auch parallel. Um ein möglichst exaktes und umfangreiches Suchergebnis zu liefern wurden verschiedene interne und externe Quellen, bzw. Resourcen und Services, abgefragt und als Ergebnis aggregiert. Meine Aufgaben bestand dabei in der Evalierung von neuen Technologien insbesondere aus dem ESB- und Integration-Framework Umfeld. Nach der Vorstellung des Evaluierungserbenisses habe ich auf Basis von Spring-MVC und Apache Camel an einer prototypischen Implementierung gearbeitet, die die Einsatzmöglichkeiten von Apache Camel als Integration-Framework verdeutlichen sollte.",
        "In meiner Diplomarbeit mit dem Thema: Analyse und Implemetierung einer Staged Event-Driven Architecture für ein Event-basiertes Query-Routing“ erweiterte ich die prototypische Implementierung dahingehend, dass die einzelnen Verarbeitungsschritte als sich selbst-verwaltende Nodes (sog. „Stages“) umgesetzt wurden, die je nach Auslastung skaliert werden konnten. Die Umsetzung erfolgte auch hier mittels Spring, Spring-MVC als GUI-Framework, sowie Apache Camel."
      ]
    }
  ]
}
